app/views/users/show.html.erb

SELECT "venues".* FROM "venues" WHERE "venues"."user_id" = $1  [["user_id", 68]]
---
  <li> Contact Number: <%= @user.phone %> </li>
  <% @user.venues.each do |venue| %>