app/controllers/menus_controller.rb

  def show
    @menu = Menu.find params[:id]
---
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", 73], ["LIMIT", 1]]