app/controllers/users_controller.rb

  def update
    @user = User.find params[:id]
    @user.update user_params
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 71], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Bernardito"], ["updated_at", "2021-10-25 04:22:13.514851"], ["id", 71]]

  def create
    @user = User.new user_params
    if @user.save # this returns true or false
---
INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"