app/controllers/venues_controller.rb

INSERT INTO "venues" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Chin Chin"], ["created_at", "2021-10-24 23:21:12.378130"], ["updated_at", "2021-10-24 23:21:12.378130"]]
---
  def create
    @venue = Venue.create venue_params

SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT $2  [["id", 67], ["LIMIT", 1]]
---
  def edit
    @venue = Venue.find params[:id]

SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT $2  [["id", 73], ["LIMIT", 1]]
UPDATE "venues" SET "name" = $1, "updated_at" = $2 WHERE "venues"."id" = $3  [["name", "Chin Chin "], ["updated_at", "2021-10-25 04:52:31.019973"], ["id", 73]]
---
  def update
    @venue = Venue.find params[:id]
    venue.update venue_params

SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
---
  def show
    @venue = Venue.find params[:id]

SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT $2  [["id", 72], ["LIMIT", 1]]
DELETE FROM "venues" WHERE "venues"."id" = $1  [["id", 72]]
---
  def destroy
    venue = Venue.find params[:id]
    venue.destroy